luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGpt12_regdef.h
/** \brief  Identification Register */
typedef struct _Ifx_GPT12_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_GPT12_ID_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_GPT12_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_GPT12_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_GPT12_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_GPT12_KRST1_Bits;

/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_GPT12_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_GPT12_KRSTCLR_Bits;

/** \brief  OCDS Control and Status Register */
typedef struct _Ifx_GPT12_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_GPT12_OCS_Bits;

/** \brief  Port Input Select Register */
typedef struct _Ifx_GPT12_PISEL_Bits
{
    unsigned int IST2IN:1;                  /**< \brief [0:0] Input Select for T2IN (rw) */
    unsigned int IST2EUD:1;                 /**< \brief [1:1] Input Select for T2EUD (rw) */
    unsigned int IST3IN:2;                  /**< \brief [3:2] Input Select for T3IN (rw) */
    unsigned int IST3EUD:2;                 /**< \brief [5:4] Input Select for T3EUD (rw) */
    unsigned int IST4IN:2;                  /**< \brief [7:6] Input Select for T4IN (rw) */
    unsigned int IST4EUD:2;                 /**< \brief [9:8] Input Select for T4EUD (rw) */
    unsigned int IST5IN:1;                  /**< \brief [10:10] Input Select for T5IN (rw) */
    unsigned int IST5EUD:1;                 /**< \brief [11:11] Input Select for T5EUD (rw) */
    unsigned int IST6IN:1;                  /**< \brief [12:12] Input Select for T6IN (rw) */
    unsigned int IST6EUD:1;                 /**< \brief [13:13] Input Select for T6EUD (rw) */
    unsigned int ISCAPIN:2;                 /**< \brief [15:14] Input Select for CAPIN (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_PISEL_Bits;

/** \brief  Timer T2 Register */
typedef struct _Ifx_GPT12_T2_Bits
{
    unsigned int T2:16;                     /**< \brief [15:0] Timer T2 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T2_Bits;

/** \brief  Timer T2 Control Register */
typedef struct _Ifx_GPT12_T2CON_Bits
{
    unsigned int T2I:3;                     /**< \brief [2:0] Timer T2 Input Parameter Selection (rw) */
    unsigned int T2M:3;                     /**< \brief [5:3] Timer T2 Mode Control (Basic Operating Mode) (rw) */
    unsigned int T2R:1;                     /**< \brief [6:6] Timer T2 Run Bit (rw) */
    unsigned int T2UD:1;                    /**< \brief [7:7] Timer T2 Up/Down Control (rw) */
    unsigned int T2UDE:1;                   /**< \brief [8:8] Timer T2 External Up/Down Enable (rw) */
    unsigned int T2RC:1;                    /**< \brief [9:9] Timer T2 Remote Control (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int T2IRDIS:1;                 /**< \brief [12:12] Timer T2 Interrupt Disable (rw) */
    unsigned int T2EDGE:1;                  /**< \brief [13:13] Timer T2 Edge Detection (rwh) */
    unsigned int T2CHDIR:1;                 /**< \brief [14:14] Timer T2 Count Direction Change (rwh) */
    unsigned int T2RDIR:1;                  /**< \brief [15:15] Timer T2 Rotation Direction (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T2CON_Bits;

/** \brief  Timer T3 Register */
typedef struct _Ifx_GPT12_T3_Bits
{
    unsigned int T3:16;                     /**< \brief [15:0] Timer T3 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T3_Bits;

/** \brief  Timer T3 Control Register */
typedef struct _Ifx_GPT12_T3CON_Bits
{
    unsigned int T3I:3;                     /**< \brief [2:0] Timer T3 Input Parameter Selection (rw) */
    unsigned int T3M:3;                     /**< \brief [5:3] Timer T3 Mode Control (rw) */
    unsigned int T3R:1;                     /**< \brief [6:6] Timer T3 Run Bit (rw) */
    unsigned int T3UD:1;                    /**< \brief [7:7] Timer T3 Up/Down Control (rw) */
    unsigned int T3UDE:1;                   /**< \brief [8:8] Timer T3 External Up/Down Enable (rw) */
    unsigned int T3OE:1;                    /**< \brief [9:9] Overflow/Underflow Output Enable (rw) */
    unsigned int T3OTL:1;                   /**< \brief [10:10] Timer T3 Overflow Toggle Latch (rwh) */
    unsigned int BPS1:2;                    /**< \brief [12:11] GPT1 Block Prescaler Control (rw) */
    unsigned int T3EDGE:1;                  /**< \brief [13:13] Timer T3 Edge Detection Flag (rwh) */
    unsigned int T3CHDIR:1;                 /**< \brief [14:14] Timer T3 Count Direction Change Flag (rwh) */
    unsigned int T3RDIR:1;                  /**< \brief [15:15] Timer T3 Rotation Direction Flag (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T3CON_Bits;

/** \brief  Timer T4 Register */
typedef struct _Ifx_GPT12_T4_Bits
{
    unsigned int T4:16;                     /**< \brief [15:0] Timer T4 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T4_Bits;

