luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGpt12_regdef.h
/** \brief  Timer T4 Control Register */
typedef struct _Ifx_GPT12_T4CON_Bits
{
    unsigned int T4I:3;                     /**< \brief [2:0] Timer T4 Input Parameter Selection (rw) */
    unsigned int T4M:3;                     /**< \brief [5:3] Timer T4 Mode Control (Basic Operating Mode) (rw) */
    unsigned int T4R:1;                     /**< \brief [6:6] Timer T4 Run Bit (rw) */
    unsigned int T4UD:1;                    /**< \brief [7:7] Timer T4 Up/Down Control (rw) */
    unsigned int T4UDE:1;                   /**< \brief [8:8] Timer T4 External Up/Down Enable (rw) */
    unsigned int T4RC:1;                    /**< \brief [9:9] Timer T4 Remote Control (rw) */
    unsigned int CLRT2EN:1;                 /**< \brief [10:10] Clear Timer T2 Enable (rw) */
    unsigned int CLRT3EN:1;                 /**< \brief [11:11] Clear Timer T3 Enable (rw) */
    unsigned int T4IRDIS:1;                 /**< \brief [12:12] Timer T4 Interrupt Disable (rw) */
    unsigned int T4EDGE:1;                  /**< \brief [13:13] Timer T4 Edge Detection (rwh) */
    unsigned int T4CHDIR:1;                 /**< \brief [14:14] Timer T4 Count Direction Change (rwh) */
    unsigned int T4RDIR:1;                  /**< \brief [15:15] Timer T4 Rotation Direction (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T4CON_Bits;

/** \brief  Timer T5 Register */
typedef struct _Ifx_GPT12_T5_Bits
{
    unsigned int T5:16;                     /**< \brief [15:0] Timer T5 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T5_Bits;

/** \brief  Timer T5 Control Register */
typedef struct _Ifx_GPT12_T5CON_Bits
{
    unsigned int T5I:3;                     /**< \brief [2:0] Timer T5 Input Parameter Selection (rw) */
    unsigned int T5M:3;                     /**< \brief [5:3] Timer T5 Mode Control (Basic Operating Mode) (rw) */
    unsigned int T5R:1;                     /**< \brief [6:6] Timer T5 Run Bit (rw) */
    unsigned int T5UD:1;                    /**< \brief [7:7] Timer T5 Up/Down Control (rw) */
    unsigned int T5UDE:1;                   /**< \brief [8:8] Timer T5 External Up/Down Enable (rw) */
    unsigned int T5RC:1;                    /**< \brief [9:9] Timer T5 Remote Control (rw) */
    unsigned int CT3:1;                     /**< \brief [10:10] Timer T3 Capture Trigger Enable (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int CI:2;                      /**< \brief [13:12] Register CAPREL Capture Trigger Selection (rw) */
    unsigned int T5CLR:1;                   /**< \brief [14:14] Timer T5 Clear Enable Bit (rw) */
    unsigned int T5SC:1;                    /**< \brief [15:15] Timer T5 Capture Mode Enable (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T5CON_Bits;

/** \brief  Timer T6 Register */
typedef struct _Ifx_GPT12_T6_Bits
{
    unsigned int T6:16;                     /**< \brief [15:0] Timer T6 (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T6_Bits;

/** \brief  Timer T6 Control Register */
typedef struct _Ifx_GPT12_T6CON_Bits
{
    unsigned int T6I:3;                     /**< \brief [2:0] Timer T6 Input Parameter Selection (rw) */
    unsigned int T6M:3;                     /**< \brief [5:3] Timer T6 Mode Control (Basic Operating Mode) (rw) */
    unsigned int T6R:1;                     /**< \brief [6:6] Timer T6 Run Bit (rw) */
    unsigned int T6UD:1;                    /**< \brief [7:7] Timer T6 Up/Down Control (rw) */
    unsigned int T6UDE:1;                   /**< \brief [8:8] Timer T6 External Up/Down Enable (rw) */
    unsigned int T6OE:1;                    /**< \brief [9:9] Overflow/Underflow Output Enable (rw) */
    unsigned int T6OTL:1;                   /**< \brief [10:10] Timer T6 Overflow Toggle Latch (rwh) */
    unsigned int BPS2:2;                    /**< \brief [12:11] GPT2 Block Prescaler Control (rw) */
    unsigned int reserved_13:1;             /**< \brief \internal Reserved */
    unsigned int T6CLR:1;                   /**< \brief [14:14] Timer T6 Clear Enable Bit (rw) */
    unsigned int T6SR:1;                    /**< \brief [15:15] Timer T6 Reload Mode Enable (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_GPT12_T6CON_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gpt12_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GPT12_ACCEN0_Bits B;                /**< \brief Bitfield access */
} Ifx_GPT12_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GPT12_ACCEN1_Bits B;                /**< \brief Bitfield access */
} Ifx_GPT12_ACCEN1;

/** \brief  Capture and Reload Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GPT12_CAPREL_Bits B;                /**< \brief Bitfield access */
} Ifx_GPT12_CAPREL;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GPT12_CLC_Bits B;                   /**< \brief Bitfield access */
} Ifx_GPT12_CLC;

/** \brief  Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GPT12_ID_Bits B;                    /**< \brief Bitfield access */
} Ifx_GPT12_ID;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GPT12_KRST0_Bits B;                 /**< \brief Bitfield access */
} Ifx_GPT12_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GPT12_KRST1_Bits B;                 /**< \brief Bitfield access */
} Ifx_GPT12_KRST1;

